v2206/urban_Microclimate/00_test_case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/air";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 1 0); 

boundaryField
{
    west
    {
        type            fixedValue;    
        value           uniform (1 1 0); 
    }
    east
    {
        type            fixedValue;    
        value           uniform (1 1 0); 
    }
    top
    {
        type            slip;
    }
    ground
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    north
    {
        type            fixedValue;    
        value           uniform (1 1 0); 
    }
    south
    {
        type            fixedValue;    
        value           uniform (1 1 0); 
    }
    buildings
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    // west
    // {
    //     type            readVectorField;
    //     inputTimeStep   86400;    
    //     value           uniform (1 1 0); 
    // }
    // east
    // {
    //     type            readVectorField;
    //     inputTimeStep   86400;    
    //     value           uniform (1 1 0); 
    // }
    // top
    // {
    //     type            slip;
    // }
    // ground
    // {
    //     type            fixedValue;
    //     value           uniform (0 0 0);
    // }
    // north
    // {
    //     type            readVectorField;
    //     inputTimeStep   86400;    
    //     value           uniform (1 1 0); 
    // }
    // south
    // {
    //     type            readVectorField;
    //     inputTimeStep   86400;    
    //     value           uniform (1 1 0); 
    // }
    // buildings
    // {
    //     type            fixedValue;
    //     value           uniform (0 0 0);
    // }
}


// ************************************************************************* //
