v2206/urban_Microclimate/00_test_case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

backgroundMesh
{
    xMin  -115; // L = 480
    xMax   365;
    yMin  -120; // L = 420
    yMax   300;
    zMin     0; // L = 150
    zMax   150;
    xCells  32;
    yCells  28;
    zCells  10;
}

convertToMeters 1;

vertices
(
    ($:backgroundMesh.xMin $:backgroundMesh.yMin $:backgroundMesh.zMin)
    ($:backgroundMesh.xMax $:backgroundMesh.yMin $:backgroundMesh.zMin)
    ($:backgroundMesh.xMax $:backgroundMesh.yMax $:backgroundMesh.zMin)
    ($:backgroundMesh.xMin $:backgroundMesh.yMax $:backgroundMesh.zMin)

    ($:backgroundMesh.xMin $:backgroundMesh.yMin $:backgroundMesh.zMax)
    ($:backgroundMesh.xMax $:backgroundMesh.yMin $:backgroundMesh.zMax)
    ($:backgroundMesh.xMax $:backgroundMesh.yMax $:backgroundMesh.zMax)
    ($:backgroundMesh.xMin $:backgroundMesh.yMax $:backgroundMesh.zMax)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (
        $:backgroundMesh.xCells
        $:backgroundMesh.yCells
        $:backgroundMesh.zCells
    )
    simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    west
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }

    east
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }
    
    north
    {
        type patch;
        faces
        (
            (3 2 6 7)
        );
    }  
    
    south
    {
        type patch;
        faces
        (
            (0 4 5 1)
        );
    }        

    ground
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }

    top
    {
        type patch;
        faces
        (
            (4 7 6 5)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
