v2206/urban_Microclimate/00_test_case/system/buildings/setset.batch
cellSet FacadesRoofs new boxToCell (0.0 0.0 0.0)(250.0 160.0 60.0)
cellZoneSet FacadesRoofs new setToCellZone FacadesRoofs
