v2206/urban_Microclimate/00_test_case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                               |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     buoyantBoussinesqPimpleFoam; //urbanMicroclimateFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         600;
deltaT          1e-6;

// endTime         86400;
// deltaT          3600;

writeControl    adjustable;

writeInterval   10;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression on;

timeFormat      general;

timePrecision   8;

runTimeModifiable true;

adjustTimeStep  true;

maxCo           0.8;

maxDeltaT       2;

// functions
// {
//     probes
//     {   
//         // Where to load it from
//         libs            ("libsampling.so");

//         type            probes;

//         // Name of the directory for probe data
//         name            probes;

//         // Write at same frequency as fields
//         writeControl    timeStep;
//         writeInterval   10;  

//         // Fields to be probed
//         fields          (T U); 
//         region air;

//         probeLocations
//         (
//             (100.595 86.3716 2.0)
//             (119.398 86.1579 2.0)
//         );
//     }    
// }

// //urbanMicroclimateFoam controls

// initialSolidTimestepFactor	0.001666667;

// minDeltaT       1E-6;

// maxDeltaT       100;

// minFluidIteration	0;
// maxFluidIteration	1000;

// pcEqnForm    pc-based; //'pc-based' or 'mixed' - default is 'pc-based'

// blending true;
// blendingCoeffs
// {
//     dampingThickness 60;
//     alphaCoeffU 0.3;
//     alphaCoeffT 0.1;
// }

// ************************************************************************* //
